{"version": "https://jsonfeed.org/version/1", "title": "Omar Olivares Urrutia", "home_page_url": "https://olivares.cl/", "feed_url": "https://olivares.cl/feed_json_updated.json", "description": "I'm a Software Engineer with a strong background in Artificial Intelligence (AI) and Machine Learning (ML) who loves turning complex ideas into practical solutions. I've worked as an AI Engineer, Developer Relations Engineer, and freelance content creator, crafting engaging AI-focused content. I've helped build AI-powered products such as Kilo Code (an autonomous coding agent), Emergent Mind (a RAG system for CS research), and a range of scalable web applications for early-stage startups.", "icon": null, "authors": [{"name": "Omar Olivares Urrutia"}], "language": "en", "items": [{"id": "https://olivares.cl/blog/2025/05/01/jiro-dreams-of-sushi/", "url": "https://olivares.cl/blog/2025/05/01/jiro-dreams-of-sushi/", "title": "Jiro Dreams of Sushi", "content_html": "<h1>Jiro Dreams of Sushi</h1>\n<p>I just watched <a href=\"https://www.imdb.com/es/title/tt1772925/\">Jiro Dreams of Sushi</a>, and I was really amazed by the quality of the documentary. I resonate highly with Jiro's philosophy and work ethic, and I think that his story is a great reminder that anyone can achieve greatness if they're willing to put in the time and effort. I think his insights are applicable to anyone in any field, not just sushi chefs.</p>\n<p>Here's a collection of quotes from a follow-up interview with Jiro and his son, Yoshikazu. Now that everyone is trying to <em>cook</em> at work, I think these insights are more relevant than ever.</p>", "image": null, "date_modified": "2025-06-17T00:05:47+00:00", "authors": [{"name": "Omar Olivares"}], "tags": ["Films"]}, {"id": "https://olivares.cl/blog/2024/01/01/learning-in-2025/", "url": "https://olivares.cl/blog/2024/01/01/learning-in-2025/", "title": "Learning in 2025", "content_html": "This year, my focus is on exploring the intersection of neuroscience and AI. I'll be diving deep into textbooks and hands-on projects to better understand both the human brain and artificial intelligence. The following lists outline the books, textbooks, and codebases that I'm currently reading and coding from.\n", "image": null, "date_modified": "2025-06-17T00:05:47+00:00", "authors": [{"name": "Omar Olivares"}], "tags": ["General"]}]}