{"version": "https://jsonfeed.org/version/1.1", "title": "Omar Olivares Urrutia", "home_page_url": "https://olivares.cl/", "feed_url": "https://olivares.cl/feed_json_updated.json", "description": "I'm a Software Engineer with a strong background in Artificial Intelligence (AI) and Machine Learning (ML) who loves turning complex ideas into practical solutions. I've worked as an AI Engineer, Developer Relations Engineer, and freelance content creator, crafting engaging AI-focused content. I've helped build AI-powered products such as Kilo Code (an autonomous coding agent), Emergent Mind (a RAG system for CS research), and a range of scalable web applications for early-stage startups.", "icon": null, "authors": [{"name": "Omar Olivares Urrutia"}], "language": "en", "items": [{"id": "https://olivares.cl/blog/2025/01/01/things-you-should-be-reading-about-ai-in-2025/", "url": "https://olivares.cl/blog/2025/01/01/things-you-should-be-reading-about-ai-in-2025/", "title": "Things you should be reading about AI in 2025", "content_html": "If your focus is exploring the intersection of neuroscience and AI. I'll be diving deep into reading material and codebases to better understand both the natural and artificial cognition. The following lists outline the books, textbooks, and codebases that I'm currently learning and probably you should too if you are interested in AI, more than just the hype.\n", "image": null, "date_modified": "2026-02-06T04:33:17+00:00", "date_published": "2025-01-01T00:00:00+00:00", "authors": [], "tags": ["Books"]}, {"id": "https://olivares.cl/blog/2025/06/10/introduction-to-tinygrad/", "url": "https://olivares.cl/blog/2025/06/10/introduction-to-tinygrad/", "title": "Introduction to Tinygrad", "content_html": "<h1>Introduction to Tinygrad</h1>\n<p>Understanding Tinygrad can be hard, even Karpathy is a bit confused about it. This guide is my first attempt to navigate Tinygrad by synthesizing insights from official documentation and various livestreams.</p>", "image": null, "date_modified": "2025-07-08T19:58:42+00:00", "date_published": "2025-06-10T00:00:00+00:00", "authors": [], "tags": ["Machine Learning"]}]}